

const errors = {
    '5000': { message: '系统未知错误！' },
    '5001': { message: '服务器内部错误！' },
    '5004': { message: '系统严重错误！' },

    '1007': { message: '用户信息不存在！' },
    '1009': { message: '用户名或密码错误，验证失败！' },
    '1012': { message: '登陆过期，请重新登陆！' },
    '1099': { message: '您无此访问权限！' },
    '1901': { message: '用户名密码不能为空！' },
    '1998': { message: '登陆信息异常！' },
    '1995': { message: '用户已登陆，请登出，切勿重复登陆！' },

    '2001': { message: '验证请求信息非法！' },

    '6000': { message: '登陆成功！' },

    '400': { message: '发出的请求有错误，服务器没有进行新建或修改数据的操作。' },
    '401': { message: '用户没有权限（令牌、用户名、密码错误）。' },
    '403': { message: '用户得到授权，但是访问是被禁止的。' },
    '404': { message: '发出的请求针对的是不存在的记录，服务器没有进行操作。' },
    '406': { message: '请求的格式不可得。' },
    '410': { message: '请求的资源被永久删除，且不会再得到的。' },
    '422': { message: '身份验证错误！' },
    '500': { message: '服务器发生错误！' },
    '502': { message: '网关错误！' },
    '503': { message: '服务不可用，服务器暂时过载或维护！' },
    '504': { message: '请求网关超时。' },
    
};

module.exports = code => {
    return { status: 'error', ...errors[code], code };
};